[
  {
    "url": "https://billmullen42.github.io/essays/Meteorite_The_Movie_Pitch.html",
    "github": "billmullen42",
    "title": "Meteorite, the Movie Pitch",
    "reason": "This essay was written for ICS 314, Software Engineering, when the author was working through issues installing Meteor on a Windows platform.  A very clever and humorous description of the problems involved with Meteor on Windows. ",
    "type": "essay",
    "date": "Fall, 2016"
  },
  {
    "url": "https://mickyjm.github.io/projects/ics111final",
    "github": "mickyjm",
    "title": "ICS 111 Music Video",
    "reason": "Introductory computer science programming projects tend to be rather simple and uninteresting.  This project is the exception, using Java and the EZ library to create a music video.",
    "type": "project",
    "date": "Fall, 2016"
  },
  {
    "url": "https://anthonyjchriste.github.io/",
    "github": "anthonyjchriste",
    "title": "Ph.D. Portfolio",
    "reason": "The ICS Department requires all Ph.D. students to develop a portfolio as part of their degree experience.  This site illustrates the use of TechFolios to satisfy the portfolio requirements.",
    "type": "site",
    "date": "Fall, 2016"
  },
  {
    "url": "https://jheadland.github.io/projects/mtg",
    "github": "jheadland",
    "title": "Manoa The Gathering",
    "reason": "Fans of Magic The Gathering might find this locally flavored version of interest. In addition to Manoa-oriented cards, the application provides a way to play the game without incurring the cost of card decks.",
    "type": "project",
    "date": "Fall, 2016"
  },
  {
    "url": "http://nathancy.github.io/nathan-lam.com",
    "github": "nathancy",
    "title": "Custom TechFolio Site",
    "reason": "TechFolio comes with a few built-in themes and the ability to easily change background colors, but if you are willing to dig into the templates, much more customization is possible. Nathan's site illustrates an extremely customized TechFolio.",
    "type": "site",
    "date": "Fall, 2016"
  }
]
